// Задача 36: Задайте одномерный массив, заполненный
// случайными числами. Найдите сумму элементов, стоящих
// на нечётных позициях.
// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0

int[] RandomArray(int min, int max, int length)
{
    int[] arr = new int[length];
    var rnd = new Random();
    for (int i = 0; i < length; i++)
    {
        arr[i] = rnd.Next(min, max + 1);
    }
    return arr;
}

int SumOfOdd(int[] arr)
{
    int sum = 0;
    for (int i = 1; i < arr.Length; i += 2)
    {
        sum += arr[i];
    }
    return sum;
}


int[] randomArray = RandomArray(-9,9,6);
Console.WriteLine($"[{string.Join(", ", randomArray)}]");

int sumOfOdd = SumOfOdd(randomArray);
Console.WriteLine($"Сумму элементов, стоящих на нечётных позициях равна {sumOfOdd}");
